app/controllers/students_controller.rb

def edit
    @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def update
    @student = Student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jordan"], ["last_name", "HudgenZ"], ["updated_at", "2021-03-12 21:33:01.116265"], ["id", 3]]